scripts/blazedemo-spike-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="BlazeDemo Spike Test" enabled="true">
      <stringProp name="TestPlan.comments">Spike Test: Baseline -> Spike 1 -> Recov 1 -> Spike 2 -> Recov 2 -> Max Spike -> Final Recov</stringProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${__P(host,www.blazedemo.com)}</stringProp>
        <stringProp name="HTTPSampler.protocol">${__P(protocol,https)}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">true</boolProp>
        <stringProp name="CookieManager.policy">standard</stringProp>
      </CookieManager>
      <hashTree/>

      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">User-Agent</stringProp>
            <stringProp name="Header.value">Mozilla/5.0 (compatible; JMeter)</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Aggressive Timer" enabled="true">
        <stringProp name="ConstantTimer.delay">500</stringProp>
      </ConstantTimer>
      <hashTree/>

      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="JTL Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/spike/spike-test-results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- THREAD GROUPS (7 Phases) -->
      
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="01 - Baseline" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
      </ThreadGroup>
      <hashTree><ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Run Flow" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="764597751">Test Plan</stringProp><stringProp name="764597751">BlazeDemo Spike Test</stringProp><stringProp name="-1948168983">Purchase Flow Fragment</stringProp></collectionProp></ModuleController><hashTree/></hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="02 - Spike 1" enabled="true">
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <stringProp name="ThreadGroup.duration">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
      </ThreadGroup>
      <hashTree><ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Run Flow" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="764597751">Test Plan</stringProp><stringProp name="764597751">BlazeDemo Spike Test</stringProp><stringProp name="-1948168983">Purchase Flow Fragment</stringProp></collectionProp></ModuleController><hashTree/></hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="03 - Recovery 1" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
      </ThreadGroup>
      <hashTree><ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Run Flow" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="764597751">Test Plan</stringProp><stringProp name="764597751">BlazeDemo Spike Test</stringProp><stringProp name="-1948168983">Purchase Flow Fragment</stringProp></collectionProp></ModuleController><hashTree/></hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="04 - Spike 2" enabled="true">
        <stringProp name="ThreadGroup.num_threads">750</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <stringProp name="ThreadGroup.duration">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
      </ThreadGroup>
      <hashTree><ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Run Flow" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="764597751">Test Plan</stringProp><stringProp name="764597751">BlazeDemo Spike Test</stringProp><stringProp name="-1948168983">Purchase Flow Fragment</stringProp></collectionProp></ModuleController><hashTree/></hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="05 - Recovery 2" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
      </ThreadGroup>
      <hashTree><ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Run Flow" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="764597751">Test Plan</stringProp><stringProp name="764597751">BlazeDemo Spike Test</stringProp><stringProp name="-1948168983">Purchase Flow Fragment</stringProp></collectionProp></ModuleController><hashTree/></hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="06 - Max Spike" enabled="true">
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <stringProp name="ThreadGroup.duration">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
      </ThreadGroup>
      <hashTree><ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Run Flow" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="764597751">Test Plan</stringProp><stringProp name="764597751">BlazeDemo Spike Test</stringProp><stringProp name="-1948168983">Purchase Flow Fragment</stringProp></collectionProp></ModuleController><hashTree/></hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="07 - Final Recovery" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
      </ThreadGroup>
      <hashTree><ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Run Flow" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="764597751">Test Plan</stringProp><stringProp name="764597751">BlazeDemo Spike Test</stringProp><stringProp name="-1948168983">Purchase Flow Fragment</stringProp></collectionProp></ModuleController><hashTree/></hashTree>

      <!-- TEST FRAGMENT WITH SHARED FLOW -->
      <TestFragmentController guiclass="TestFragmentControllerGui" testclass="TestFragmentController" testname="Purchase Flow Fragment" enabled="true"/>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 - Home Page" enabled="true">
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Status 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="49586">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 - Select Flight" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="fromPort" elementType="HTTPArgument"><stringProp name="Argument.value">Paris</stringProp><stringProp name="Argument.name">fromPort</stringProp></elementProp>
              <elementProp name="toPort" elementType="HTTPArgument"><stringProp name="Argument.value">Buenos Aires</stringProp><stringProp name="Argument.name">toPort</stringProp></elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/reserve.php</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Status 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="49586">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03 - Purchase Page" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="flight" elementType="HTTPArgument"><stringProp name="Argument.value">233</stringProp><stringProp name="Argument.name">flight</stringProp></elementProp>
              <elementProp name="price" elementType="HTTPArgument"><stringProp name="Argument.value">638.08</stringProp><stringProp name="Argument.name">price</stringProp></elementProp>
              <elementProp name="airline" elementType="HTTPArgument"><stringProp name="Argument.value">Virgin America</stringProp><stringProp name="Argument.name">airline</stringProp></elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/purchase.php</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Status 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="49586">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="04 - Confirm Purchase" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="inputName" elementType="HTTPArgument"><stringProp name="Argument.value">Test User</stringProp><stringProp name="Argument.name">inputName</stringProp></elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/confirmation.php</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Status 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="49586">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Success Msg" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="1">Thank you for your purchase</stringProp></collectionProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>